#Множества - ті самі списки елементи в случайноу порядку і немає повторяюхщися елементів

data = set('hello')                   #set - преображає в множество

print(data)

val = {4, 1, 2, 3}                #якщо не указувати ключі то создаємо множество
print(val)
val.add(32)                      #add - добавляє елемент
val.update([3, True, 3.2])         #update - додає декілька елементів
val.remove(True)                  #remove - удалити елемент з определьонним значенням
val.pop()                          #pop - удалити перший елемент
#val.clear()                        #clear - очистити повністю


nums = [5, 6, 5, 1, 2, 6]
new_nums = set(nums)

print(new_nums)
#удалення повторяющихся елементів

#Frozen set - замороженное множество обьєднання кортежа і множества

n_data = frozenset([5, 6, 1, 2, 1, 6, 8, 8, 2, True])

print(n_data)
#кортеж + множество де не буде повторяющихся елементів і будуть виведені в хаотичному порядку

